def area(a):
    '''
    Принимает длину стороны квадрата a, возвращает площадь квадрата.

    Формула:
        S = a²

    Параметры:
        a (float): длина стороны квадрата

    Возвращаемое значение:
        float: площадь квадрата

    Пример:
        >>> area(4)
        16
    '''
    return a * a


def perimeter(a):
    '''
    Принимает длину стороны квадрата a, возвращает периметр квадрата.

    Формула:
        P = 4 * a

    Параметры:
        a (float): длина стороны квадрата

    Возвращаемое значение:
        float: периметр квадрата

    Пример:
        >>> perimeter(4)
        16
    '''
    return 4 * a
